app/Controllers/FraisController.php

    public function list()
    {
        $data['frais_list'] = $this->fraisModel->getFraisWithOperation();
        $data['operations'] = $this->operationModel->findAll();
---
SELECT *
FROM `operation`

    public function create()
    {
        $rules = [
            'operation_id' => 'required|is_not_unique[operation.id]',
            'min'          => 'required|numeric|greater_than_equal_to[0]',
            'max'          => 'required|numeric|greater_than[min]',
            'frais_val'    => 'required|numeric|greater_than_equal_to[0]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->fraisModel->insert([
            'operation_id' => $this->request->getPost('operation_id'),
            'min'          => $this->request->getPost('min'),
            'max'          => $this->request->getPost('max'),
            'frais_val'    => $this->request->getPost('frais_val')
        ]);
---
INSERT INTO `frais` (`operation_id`, `min`, `max`, `frais_val`) VALUES ('2', '500001', '1000000', '4000')