app/Controllers/OperationController.php

SELECT *
FROM `operation`
---
    public function list()
    {
        $data['operations'] = $this->operationModel->findAll();

INSERT INTO `operation` (`nom`, `code`) VALUES ('SADF', 'ASDF')
---
    public function create()
    {
        $rules = [
            'nom'  => 'required|min_length[3]|max_length[50]',
            'code' => 'required|is_unique[operation.code]|min_length[2]|max_length[10]|alpha_numeric'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->operationModel->insert([
            'nom'  => $this->request->getPost('nom'),
            'code' => strtoupper($this->request->getPost('code'))
        ]);

UPDATE `operation` SET `nom` = 'Dépôt', `code` = 'DEP'
WHERE `operation`.`id` IN ('1')
---
    public function update($id)
    {
        $rules = [
            'nom'  => 'required|min_length[3]|max_length[50]',
            'code' => "required|min_length[2]|max_length[10]|alpha_numeric|is_unique[operation.code,id,{$id}]"
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->operationModel->update($id, [
            'nom'  => $this->request->getPost('nom'),
            'code' => strtoupper($this->request->getPost('code'))
        ]);

SELECT *
FROM `operation`
WHERE `operation`.`id` = '6'
DELETE FROM `operation`
WHERE `id` IN ('6')
---
    public function delete($id)
    {
        if ($this->operationModel->find($id)) {
            $this->operationModel->delete($id);