app/Models/CommissionTransactionModel.php

    public function getMontantsARendreParOperateur()
    {
        return $this->db->table('solde_par_operateur')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `solde_par_operateur`