app/Models/EpargneModel.php

    public function getPourcentage($idClient)
    {
        return $this->where('id_client', $idClient)->first()['prct'];
---
SELECT *
FROM `epargne`
WHERE `id_client` = 1
 LIMIT 1

    public function  effectuerEpargne($numClient, $montant) {
        $mvtEpargeModel = new MvtEpargeModel();
        $userModel = new UserModel();

        //recuecher le cleitn
        $clientId =  $userModel->findByNumero($numClient)['id'];

        $pourcentageEparge = $this->getPourcentage($clientId);

        $montantAEpargner = $montant * $pourcentageEparge/100;

        $mvtEpargeModel->save([
            'id_client' => $clientId,
            'montant' => $montantAEpargner
        ]);
---
INSERT INTO `mvt_eparge` (`id_client`, `montant`, `created_at`) VALUES (1, 200.2, '2026-07-21 08:34:49')