app/Models/FraisModel.php

    public function getFraisWithOperation(): array
    {
        return $this->select('frais.*, operation.nom AS operation_nom, operation.code AS operation_code')
                    ->join('operation', 'operation.id = frais.operation_id')
                    ->orderBy('operation.id', 'ASC')
                    ->orderBy('frais.min', 'ASC')
                    ->findAll();
---
SELECT `frais`.*, `operation`.`nom` AS `operation_nom`, `operation`.`code` AS `operation_code`
FROM `frais`
JOIN `operation` ON `operation`.`id` = `frais`.`operation_id`
ORDER BY `operation`.`id` ASC, `frais`.`min` ASC

    public function getFraisWithOperationWhereIdOperation($idOperation): array
    {
        return $this->select('frais.*, operation.nom AS operation_nom, operation.code AS operation_code')
                    ->join('operation', 'operation.id = frais.operation_id')
                    ->where("operation_id=",$idOperation)
                    ->orderBy('operation.id', 'ASC')
                    ->orderBy('frais.min', 'ASC')
                    ->findAll();
---
SELECT `frais`.*, `operation`.`nom` AS `operation_nom`, `operation`.`code` AS `operation_code`
FROM `frais`
JOIN `operation` ON `operation`.`id` = `frais`.`operation_id`
WHERE `operation_id` = '3'
ORDER BY `operation`.`id` ASC, `frais`.`min` ASC

    public function getGainTransfert(): float
    {
        $builder = $this->db->table('v_transaction_and_type_operation');
        $result  = $builder->selectSum('frais_montant', 'total_gain')
                           ->where('code_operation', 'TRA')
                           ->get()
                           ->getRowArray();
---
SELECT SUM(`frais_montant`) AS `total_gain`
FROM `v_transaction_and_type_operation`
WHERE `code_operation` = 'RET'