app/Models/NumPrefixeValableModel.php

SELECT `prefix`
FROM `num_prefixe_valable`
WHERE `actif` = 1
---
    public function isNumValid($num)
    {
        $num = preg_replace('/\s+/', '', $num);

        if (!preg_match('/^\d{10}$/', $num)) {
            return false;
        }

        $prefixesActifs = $this->where('actif', 1)->findColumn('prefix');