app/Models/NumPrefixeValableModel.php

    private function checkAgainstPrefixes($num, $onlyOurs)
    {
        $num = preg_replace('/\s+/', '', $num);
        if (!preg_match('/^\d{10}$/', $num)) {
            return false;
        }

        $builder = $this
            ->select('num_prefixe_valable.prefix')
            ->join('operateur', 'operateur.id = num_prefixe_valable.operateur_id')
            ->where('num_prefixe_valable.actif', 1);

        if ($onlyOurs) {
            $builder->where('operateur.a_nous', 1);
        }

        $prefixesActifs = $builder->findColumn('prefix') ?? [];
---
SELECT `num_prefixe_valable`.`prefix`, `prefix`
FROM `num_prefixe_valable`
JOIN `operateur` ON `operateur`.`id` = `num_prefixe_valable`.`operateur_id`
WHERE `num_prefixe_valable`.`actif` = 1
AND `operateur`.`a_nous` = 1

    public function getOperateur(string $phone): ?array
    {
        $phone = preg_replace('/\s+/', '', $phone);

        if (!preg_match('/^\d{10}$/', $phone)) {
            return null;
        }

        $prefixes = $this->select('num_prefixe_valable.prefix, operateur.id, operateur.nom, operateur.a_nous')
                         ->join('operateur', 'operateur.id = num_prefixe_valable.operateur_id')
                         ->where('num_prefixe_valable.actif', 1)
                         ->findAll();
---
SELECT `num_prefixe_valable`.`prefix`, `operateur`.`id`, `operateur`.`nom`, `operateur`.`a_nous`
FROM `num_prefixe_valable`
JOIN `operateur` ON `operateur`.`id` = `num_prefixe_valable`.`operateur_id`
WHERE `num_prefixe_valable`.`actif` = 1