app/Models/ReductionModel.php

SELECT *
FROM `reduction`
 LIMIT 1
---
    public function getReduction(){
        return $this->first()['reduct'];