app/Models/TransactionModel.php

            'description'     => $data['desc'] ?? null
        ];

        $insertedId = $this->insert($transactionData);
---
INSERT INTO `transactions` (`user_id`, `operation_id`, `destinataire_id`, `montant`, `frais_montant`, `description`, `date_op`) VALUES (2, '3', 3, 1000, 500, '', '2026-07-20 13:52:44')