app/Models/TransactionModel.php

INSERT INTO `transactions` (`user_id`, `operation_id`, `destinataire_id`, `num_dest`, `montant`, `frais_montant`, `description`, `date_op`) VALUES (2, '3', 1, '0381234567', 1001, 200, '', '2026-07-21 07:33:46')
---
        ];

        // Insertion et récupération de l'ID
        $insertedId = $this->insert($transactionData);

SELECT `transactions`.`id` as `ref`, `operation`.`nom` as `operation`, COALESCE(destinataire.numero, transactions.num_dest) as destinataire_numero, `transactions`.`montant`, `transactions`.`frais_montant` as `frais`, `transactions`.`description`, `transactions`.`date_op`
FROM `transactions`
JOIN `operation` ON `operation`.`id` = `transactions`.`operation_id`
LEFT JOIN `users` as `destinataire` ON `destinataire`.`id` = `transactions`.`destinataire_id`
WHERE `transactions`.`user_id` = 2
ORDER BY `transactions`.`date_op` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `transactions`
JOIN `operation` ON `operation`.`id` = `transactions`.`operation_id`
LEFT JOIN `users` as `destinataire` ON `destinataire`.`id` = `transactions`.`destinataire_id`
WHERE `transactions`.`user_id` = 2
---
    public function historiqueTransaction($userId, $filters = [], $perPage = 5)
    {
        $builder = $this
            ->select('
                transactions.id as ref,
                operation.nom as operation,
                COALESCE(destinataire.numero, transactions.num_dest) as destinataire_numero,
                transactions.montant,
                transactions.frais_montant as frais,
                transactions.description,
                transactions.date_op
            ')
            ->join('operation', 'operation.id = transactions.operation_id')
            ->join('users as destinataire', 'destinataire.id = transactions.destinataire_id', 'left')
            ->where('transactions.user_id', $userId);

        if (!empty($filters['operation_id'])) {
            $builder->where('transactions.operation_id', $filters['operation_id']);
        }

        if (!empty($filters['date_debut'])) {
            $builder->where('transactions.date_op >=', $filters['date_debut'] . ' 00:00:00');
        }

        if (!empty($filters['date_fin'])) {
            $builder->where('transactions.date_op <=', $filters['date_fin'] . ' 23:59:59');
        }

        return $builder->orderBy('transactions.date_op', 'DESC')->paginate($perPage);