app/Models/UserModel.php

    public function findByNumero($phone)
    {
        return $this->where('numero', $phone)->first();
---
SELECT *
FROM `users`
WHERE `numero` = '0381234567'
 LIMIT 1

    public function getClientsWithSolde(): array
    {
        return $this->select('users.*, COALESCE(v_solde_compte_client.solde, 0) AS solde')
                    ->join('v_solde_compte_client', 'v_solde_compte_client.user_id = users.id', 'left')
                    ->where('users.role', 'client')
                    ->findAll();
---
SELECT `users`.*, COALESCE(v_solde_compte_client.solde, 0) AS solde
FROM `users`
LEFT JOIN `v_solde_compte_client` ON `v_solde_compte_client`.`user_id` = `users`.`id`
WHERE `users`.`role` = 'client'

    public function getClientWithSoldeById(int $userId): ?array
    {
        return $this->select('users.*, COALESCE(v_solde_compte_client.solde, 0) AS solde')
                    ->join('v_solde_compte_client', 'v_solde_compte_client.user_id = users.id', 'left')
                    ->where('users.role', 'client')
                    ->where('users.id', $userId)
                    ->first();
---
SELECT `users`.*, COALESCE(v_solde_compte_client.solde, 0) AS solde
FROM `users`
LEFT JOIN `v_solde_compte_client` ON `v_solde_compte_client`.`user_id` = `users`.`id`
WHERE `users`.`role` = 'client'
AND `users`.`id` = 2
 LIMIT 1